#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: bf362c34b7c685177a1aec0b95df1ed0.pdb
; shader hash: bf362c34b7c685177a1aec0b95df1ed0
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.SceneConstantBuffer
;       {
;
;           row_major float4x4 projectionToWorld;     ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; cbuffer g_cubeCB
; {
;
;   struct g_cubeCB
;   {
;
;       struct struct.CubeConstantBuffer
;       {
;
;           float4 albedo;                            ; Offset:    0
;       
;       } g_cubeCB;                                   ; Offset:    0
;
;   
;   } g_cubeCB;                                       ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for Vertices
; {
;
;   struct struct.Vertex
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !25, globals: !157)
!1 = !DIFile(filename: "assets\5Cshaders_hlsl\5Cassets\5Cshaders_hlsl\5CRaytracingCube.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 142, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 142, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 142, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 142, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 91, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 91, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 91, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 91, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 91, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 91, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !{!26, !36, !47, !50, !55, !59, !62, !68, !75, !78, !81, !108, !111, !114, !126, !132, !135, !138, !146, !149, !152}
!26 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$01@@@Z", scope: !27, file: !27, line: 18, type: !28, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false)
!27 = !DIFile(filename: "assets\5Cshaders_hlsl/RaytracingHelper.hlsli", directory: "")
!28 = !DISubroutineType(types: !29)
!29 = !{!18, !30}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!23, !12}
!36 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$02@@@Z", scope: !27, file: !27, line: 23, type: !37, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!37 = !DISubroutineType(types: !38)
!38 = !{!18, !39}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 21, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 21, size: 96, align: 32, elements: !41, templateParams: !45)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 21, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 21, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !40, file: !1, line: 21, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!23, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!47 = !DISubprogram(name: "CalculateAnimationInterpolant", linkageName: "\01?CalculateAnimationInterpolant@@YAMMM@Z", scope: !27, file: !27, line: 29, type: !48, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!18, !18, !18}
!50 = !DISubprogram(name: "swap", linkageName: "\01?swap@@YAXAIAM0@Z", scope: !27, file: !27, line: 36, type: !51, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53, !53}
!53 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !18)
!55 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NMMM@Z", scope: !27, file: !27, line: 43, type: !56, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !18, !18, !18}
!58 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!59 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !27, file: !27, line: 69, type: !60, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!39}
!62 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !27, file: !27, line: 74, type: !63, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!39, !65, !30}
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 288, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DISubprogram(name: "IsCulled", linkageName: "\01?IsCulled@@YA_NURay@@V?$vector@M$02@@@Z", scope: !27, file: !27, line: 114, type: !69, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!58, !71, !39}
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !27, line: 12, size: 192, align: 32, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !71, file: !27, line: 14, baseType: !39, size: 96, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !71, file: !27, line: 15, baseType: !39, size: 96, align: 32, offset: 96)
!75 = !DISubprogram(name: "IsAValidHit", linkageName: "\01?IsAValidHit@@YA_NURay@@MV?$vector@M$02@@@Z", scope: !27, file: !27, line: 127, type: !76, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!58, !71, !18, !39}
!78 = !DISubprogram(name: "TexCoords", linkageName: "\01?TexCoords@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !27, file: !27, line: 133, type: !79, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!30, !39}
!81 = !DISubprogram(name: "CalculateRayDifferentials", linkageName: "\01?CalculateRayDifferentials@@YAXAIAV?$vector@M$01@@0V1@V?$vector@M$02@@22V?$matrix@M$03$03@@@Z", scope: !27, file: !27, line: 139, type: !82, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84, !84, !30, !39, !39, !39, !86}
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !30)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 136, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 136, size: 512, align: 32, elements: !88, templateParams: !105)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !87, file: !1, line: 136, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!105 = !{!23, !106, !107}
!106 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!107 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!108 = !DISubprogram(name: "AnalyticalCheckersTexture", linkageName: "\01?AnalyticalCheckersTexture@@YAMV?$vector@M$02@@00V?$matrix@M$03$03@@@Z", scope: !27, file: !27, line: 158, type: !109, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!18, !39, !39, !39, !86}
!111 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !27, file: !27, line: 169, type: !112, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false)
!112 = !DISubroutineType(types: !113)
!113 = !{!39, !39, !39, !39}
!114 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@I@Z", scope: !115, file: !115, line: 48, type: !116, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!115 = !DIFile(filename: "assets\5Cshaders_hlsl\5CRaytracingCube.hlsl", directory: "")
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !125}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 173, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 173, size: 96, align: 32, elements: !120, templateParams: !124)
!120 = !{!121, !122, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !119, file: !1, line: 173, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !119, file: !1, line: 173, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !119, file: !1, line: 173, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!124 = !{!11, !46}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 173, baseType: !8)
!126 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !115, file: !115, line: 86, type: !127, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!127 = !DISubroutineType(types: !128)
!128 = !{!39, !65, !129}
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 77, size: 64, align: 32, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !129, file: !1, line: 77, baseType: !31, size: 64, align: 32)
!132 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@V?$vector@M$02@@0@Z", scope: !115, file: !115, line: 111, type: !133, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubroutineType(types: !134)
!134 = !{!14, !39, !39}
!135 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !115, file: !115, line: 122, type: !136, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!136 = !DISubroutineType(types: !137)
!137 = !{null}
!138 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !115, file: !115, line: 147, type: !139, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!139 = !DISubroutineType(types: !140)
!140 = !{null, !141, !145}
!141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !115, line: 80, size: 128, align: 32, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !142, file: !115, line: 82, baseType: !14, size: 128, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !115, line: 79, baseType: !129)
!146 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !115, file: !115, line: 179, type: !147, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!147 = !DISubroutineType(types: !148)
!148 = !{null, !141}
!149 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !27, file: !27, line: 49, type: !150, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!150 = !DISubroutineType(types: !151)
!151 = !{!71, !4, !39, !86}
!152 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !115, file: !115, line: 94, type: !153, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !4, !155, !155}
!155 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39)
!157 = !{!158, !160, !161, !163, !167, !169}
!158 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 119, type: !159, isLocal: true, isDefinition: true, variable: i32 16)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!160 = !DIGlobalVariable(name: "RAY_FLAG_CULL_FRONT_FACING_TRIANGLES", scope: !0, file: !1, line: 121, type: !159, isLocal: true, isDefinition: true, variable: i32 32)
!161 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !115, line: 35, type: !162, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 35, size: 32, align: 32, elements: !2)
!163 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !115, line: 38, type: !164, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!164 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 38, size: 128, align: 32, elements: !2, templateParams: !165)
!165 = !{!166}
!166 = !DITemplateTypeParameter(name: "element", type: !15)
!167 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !115, line: 40, type: !168, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 40, size: 32, align: 32, elements: !2)
!169 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !115, line: 41, type: !170, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A")
!170 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 41, size: 192, align: 32, elements: !2, templateParams: !171)
!171 = !{!172}
!172 = !DITemplateTypeParameter(name: "element", type: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !115, line: 15, size: 192, align: 32, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !173, file: !115, line: 17, baseType: !39, size: 96, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !173, file: !115, line: 18, baseType: !39, size: 96, align: 32, offset: 96)
!177 = !{i32 2, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{!"dxc 1.2"}
!180 = !{!"assets\5Cshaders_hlsl\5CRaytracingCube.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A#define HLSL\0D\0A\0D\0A#include \22RaytracingHelper.hlsli\22\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A};\0D\0A\0D\0Astruct CubeConstantBuffer {\0D\0A    float4 albedo;\0D\0A};\0D\0A\0D\0Astruct SceneConstantBuffer\0D\0A{\0D\0A    float4x4 projectionToWorld;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0A// the register means the data is accessible in the first unordered access variable \0D\0A// (UAV, identified by the letter u) bound to the shader.\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0A//Shader resources (SRV) correspond to the letter t\0D\0AByteAddressBuffer Indices : register(t1, space0);\0D\0AStructuredBuffer<Vertex> Vertices : register(t2, space0);\0D\0A\0D\0A//Constant buffers (CBV), can be accessed using the letter b.\0D\0AConstantBuffer<SceneConstantBuffer> g_sceneCB : register(b0);\0D\0AConstantBuffer<CubeConstantBuffer> g_cubeCB : register(b1);\0D\0A\0D\0A// Load three 16 bit indices from a byte addressed buffer.\0D\0Auint3 Load3x16BitIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3;\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A\0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes)\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff;\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0D\0Afloat3 HitAttribute(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), g_sceneCB.projectionToWorld);\0D\0A\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin);\0D\0A}\0D\0A\0D\0A// Diffuse lighting calculation.\0D\0Afloat4 CalculateDiffuseLighting(float3 hitPosition, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(g_sceneCB.lightPosition.xyz - hitPosition);\0D\0A\0D\0A    // Diffuse contribution.\0D\0A    float fNDotL = max(0.0f, dot(pixelToLight, normal));\0D\0A\0D\0A    return g_cubeCB.albedo * g_sceneCB.lightDiffuseColor * fNDotL;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A\0D\0A    // Get the base index of the triangle's first 16 bit index.\0D\0A    uint indexSizeInBytes = 2;\0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint triangleIndexStride = indicesPerTriangle * indexSizeInBytes;\0D\0A    uint baseIndex = PrimitiveIndex() * triangleIndexStride;\0D\0A\0D\0A    // Load up 3 16 bit indices for the triangle.\0D\0A    const uint3 indices = Load3x16BitIndices(baseIndex);\0D\0A\0D\0A    // Retrieve corresponding vertex normals for the triangle vertices.\0D\0A    float3 vertexNormals[3] = {\0D\0A        Vertices[indices[0]].normal,\0D\0A        Vertices[indices[1]].normal,\0D\0A        Vertices[indices[2]].normal\0D\0A    };\0D\0A\0D\0A    // Compute the triangle's normal.\0D\0A    // This is redundant and done for illustration purposes \0D\0A    // as all the per-vertex normals are the same and match triangle's normal in this sample. \0D\0A    float3 triangleNormal = HitAttribute(vertexNormals, attr);\0D\0A\0D\0A    float4 diffuseColor = CalculateDiffuseLighting(hitPosition, triangleNormal);\0D\0A    float4 color = g_sceneCB.lightAmbientColor + diffuseColor;\0D\0A\0D\0A    payload.color = color;\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.0f, 0.2f, 0.4f, 1.0f);\0D\0A    payload.color = background;\0D\0A}\0D\0A\0D\0A"}
!181 = !{!"assets\5Cshaders_hlsl/RaytracingHelper.hlsli", !"\0D\0A#ifndef RAYTRACINGHELPER_H\0D\0A#define RAYTRACINGHELPER_H\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A#define INFINITY (1.0/0.0)\0D\0A\0D\0A#define MAX_RAYTRACING_DEPTH 3\0D\0A\0D\0Astruct Ray\0D\0A{\0D\0A    float3 origin;\0D\0A    float3 direction;\0D\0A};\0D\0A\0D\0Afloat length_toPow2(float2 p)\0D\0A{\0D\0A    return dot(p, p);\0D\0A}\0D\0A\0D\0Afloat length_toPow2(float3 p)\0D\0A{\0D\0A    return dot(p, p);\0D\0A}\0D\0A\0D\0A// Returns a cycling <0 -> 1 -> 0> animation interpolant \0D\0Afloat CalculateAnimationInterpolant(in float elapsedTime, in float cycleDuration)\0D\0A{\0D\0A    float curLinearCycleTime = fmod(elapsedTime, cycleDuration) / cycleDuration;\0D\0A    curLinearCycleTime = (curLinearCycleTime <= 0.5f) ? 2 * curLinearCycleTime : 1 - 2 * (curLinearCycleTime - 0.5f);\0D\0A    return smoothstep(0, 1, curLinearCycleTime);\0D\0A}\0D\0A\0D\0Avoid swap(inout float a, inout float b)\0D\0A{\0D\0A    float temp = a;\0D\0A    a = b;\0D\0A    b = temp;\0D\0A}\0D\0A\0D\0Abool IsInRange(in float val, in float min, in float max)\0D\0A{\0D\0A    return (val >= min && val <= max);\0D\0A}\0D\0A\0D\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0Ainline Ray GenerateCameraRay(uint2 index, in float3 cameraPosition, in float4x4 projectionToWorld)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a world positon.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0D\0A    world.xyz /= world.w;\0D\0A\0D\0A    Ray ray;\0D\0A    ray.origin = cameraPosition;\0D\0A    ray.direction = normalize(world.xyz - ray.origin);\0D\0A\0D\0A    return ray;\0D\0A}\0D\0A\0D\0A// Retrieve hit world position.\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0D\0Afloat3 HitAttribute(float3 vertexAttribute[3], float2 barycentrics)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0A// Load three 16 bit indices.\0D\0Astatic\0D\0Auint3 Load3x16BitIndices(uint offsetBytes, ByteAddressBuffer Indices)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3;// \E5\88\A4\E6\96\AD\E6\98\AF\E5\90\A64byte\E5\AF\B9\E9\BD\90   offsetBytes & ..111100 //\E5\88\A4\E6\96\AD\E6\98\AF\E5\90\A6\E6\98\AF4\E7\9A\84\E8\AF\81\E4\B9\A6\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A\0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes)\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff;\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A// Test if a hit is culled based on specified RayFlags.\0D\0Abool IsCulled(in Ray ray, in float3 hitSurfaceNormal)\0D\0A{\0D\0A    float rayDirectionNormalDot = dot(ray.direction, hitSurfaceNormal);\0D\0A\0D\0A    bool isCulled =\0D\0A        ((RayFlags() & RAY_FLAG_CULL_BACK_FACING_TRIANGLES) && (rayDirectionNormalDot > 0))\0D\0A        ||\0D\0A        ((RayFlags() & RAY_FLAG_CULL_FRONT_FACING_TRIANGLES) && (rayDirectionNormalDot < 0));\0D\0A\0D\0A    return isCulled;\0D\0A}\0D\0A\0D\0A// Test if a hit is valid based on specified RayFlags and <RayTMin, RayTCurrent> range.\0D\0Abool IsAValidHit(in Ray ray, in float thit, in float3 hitSurfaceNormal)\0D\0A{\0D\0A    return IsInRange(thit, RayTMin(), RayTCurrent()) && !IsCulled(ray, hitSurfaceNormal);\0D\0A}\0D\0A\0D\0A// Texture coordinates on a horizontal plane.\0D\0Afloat2 TexCoords(in float3 position)\0D\0A{\0D\0A    return position.xz;\0D\0A}\0D\0A\0D\0A// Calculate ray differentials.\0D\0Avoid CalculateRayDifferentials(out float2 ddx_uv, out float2 ddy_uv, in float2 uv, in float3 hitPosition, in float3 surfaceNormal, in float3 cameraPosition, in float4x4 projectionToWorld)\0D\0A{\0D\0A    // Compute ray differentials by intersecting the tangent plane to the  surface.\0D\0A    Ray ddx = GenerateCameraRay(DispatchRaysIndex().xy + uint2(1, 0), cameraPosition, projectionToWorld);\0D\0A    Ray ddy = GenerateCameraRay(DispatchRaysIndex().xy + uint2(0, 1), cameraPosition, projectionToWorld);\0D\0A\0D\0A    // Compute ray differentials.\0D\0A    float3 ddx_pos = ddx.origin - ddx.direction * dot(ddx.origin - hitPosition, surfaceNormal) / dot(ddx.direction, surfaceNormal);\0D\0A    float3 ddy_pos = ddy.origin - ddy.direction * dot(ddy.origin - hitPosition, surfaceNormal) / dot(ddy.direction, surfaceNormal);\0D\0A\0D\0A    // Calculate texture sampling footprint.\0D\0A    ddx_uv = TexCoords(ddx_pos) - uv;\0D\0A    ddy_uv = TexCoords(ddy_pos) - uv;\0D\0A}\0D\0A\0D\0A// Forward declaration.\0D\0Afloat CheckersTextureBoxFilter(in float2 uv, in float2 dpdx, in float2 dpdy, in uint ratio);\0D\0A\0D\0A// Return analytically integrated checkerboard texture (box filter).\0D\0Afloat AnalyticalCheckersTexture(in float3 hitPosition, in float3 surfaceNormal, in float3 cameraPosition, in float4x4 projectionToWorld)\0D\0A{\0D\0A    float2 ddx_uv;\0D\0A    float2 ddy_uv;\0D\0A    float2 uv = TexCoords(hitPosition);\0D\0A\0D\0A    CalculateRayDifferentials(ddx_uv, ddy_uv, uv, hitPosition, surfaceNormal, cameraPosition, projectionToWorld);\0D\0A    return CheckersTextureBoxFilter(uv, ddx_uv, ddy_uv, 50);\0D\0A}\0D\0A\0D\0A// Fresnel reflectance - schlick approximation.\0D\0Afloat3 FresnelReflectanceSchlick(in float3 I, in float3 N, in float3 f0)\0D\0A{\0D\0A    float cosi = saturate(dot(-I, N));\0D\0A    return f0 + (1 - f0) * pow(1 - cosi, 5);\0D\0A}\0D\0A\0D\0A#endif // RAYTRACINGHELPER_H"}
!182 = !{!"assets\5Cshaders_hlsl\5CRaytracingCube.hlsl"}
!183 = !{!"/T", !"lib_6_3", !"/Fo", !"..\5Cbin\5CDebug-windows-x86_64\5CSandbox\5CRaytracingCube.cso", !"/Od", !"/Zi", !"/Zpr"}
!184 = !{i32 1, i32 3}
!185 = !{i32 1, i32 5}
!186 = !{!"lib", i32 6, i32 3}
!187 = !{!188, !194, !197, null}
!188 = !{!189, !191, !192}
!189 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !190}
!190 = !{i32 0, i32 4}
!191 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 0, i32 1, i32 1, i32 11, i32 0, null}
!192 = !{i32 2, %"class.StructuredBuffer<Vertex>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A", !"Vertices", i32 0, i32 2, i32 1, i32 12, i32 0, !193}
!193 = !{i32 1, i32 24}
!194 = !{!195}
!195 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !196}
!196 = !{i32 0, i32 9}
!197 = !{!198, !199}
!198 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 0, i32 0, i32 1, i32 128, null}
!199 = !{i32 1, %g_cubeCB* @g_cubeCB, !"g_cubeCB", i32 0, i32 1, i32 1, i32 16, null}
!200 = !{i32 0, %struct.Ray undef, !201, %struct.RaytracingAccelerationStructure undef, !204, %"class.RWTexture2D<vector<float, 4> >" undef, !206, %struct.ByteAddressBuffer undef, !204, %"class.StructuredBuffer<Vertex>" undef, !208, %struct.Vertex undef, !210, %struct.SceneConstantBuffer undef, !213, %struct.CubeConstantBuffer undef, !220, %struct.BuiltInTriangleIntersectionAttributes undef, !222, %struct.RayDesc undef, !224, %struct.RayPayload undef, !229, %g_sceneCB undef, !231, %g_cubeCB undef, !233}
!201 = !{i32 28, !202, !203}
!202 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!203 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!204 = !{i32 4, !205}
!205 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!206 = !{i32 16, !207}
!207 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!208 = !{i32 28, !209}
!209 = !{i32 6, !"h", i32 3, i32 0}
!210 = !{i32 28, !211, !212}
!211 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!212 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!213 = !{i32 128, !214, !216, !217, !218, !219}
!214 = !{i32 6, !"projectionToWorld", i32 2, !215, i32 3, i32 0, i32 7, i32 9}
!215 = !{i32 4, i32 4, i32 1}
!216 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!217 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!218 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!219 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!220 = !{i32 16, !221}
!221 = !{i32 6, !"albedo", i32 3, i32 0, i32 7, i32 9}
!222 = !{i32 8, !223}
!223 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!224 = !{i32 32, !225, !226, !227, !228}
!225 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!226 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!227 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!228 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!229 = !{i32 16, !230}
!230 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!231 = !{i32 128, !232}
!232 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!233 = !{i32 16, !234}
!234 = !{i32 6, !"g_cubeCB", i32 3, i32 0}
!235 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !236, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !238, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !241}
!236 = !{!237}
!237 = !{i32 1, !2, !2}
!238 = !{!237, !239, !240}
!239 = !{i32 2, !2, !2}
!240 = !{i32 0, !2, !2}
!241 = !{!237, !239}
!242 = !{null, !"", null, !187, !243}
!243 = !{i32 0, i64 65553}
!244 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !245}
!245 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !246}
!246 = !{i32 0}
!247 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !248}
!248 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !246}
!249 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !250}
!250 = !{i32 8, i32 7, i32 5, !246}
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !135, file: !115, line: 124, type: !39)
!252 = !DIExpression()
!253 = !DILocation(line: 124, column: 12, scope: !135)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !135, file: !115, line: 125, type: !39)
!255 = !DILocation(line: 125, column: 12, scope: !135)
!256 = !DILocation(line: 128, column: 23, scope: !135)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !152, file: !115, line: 94, type: !155)
!258 = !DIExpression(DW_OP_deref)
!259 = !DILocation(line: 94, column: 74, scope: !152, inlinedAt: !260)
!260 = distinct !DILocation(line: 128, column: 5, scope: !135)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !152, file: !115, line: 94, type: !155)
!262 = !DILocation(line: 94, column: 55, scope: !152, inlinedAt: !260)
!263 = !DILocation(line: 128, column: 5, scope: !135)
!264 = !DILocation(line: 96, column: 17, scope: !152, inlinedAt: !260)
!265 = !DILocation(line: 96, column: 23, scope: !152, inlinedAt: !260)
!266 = !DILocation(line: 96, column: 12, scope: !152, inlinedAt: !260)
!267 = !DILocation(line: 97, column: 24, scope: !152, inlinedAt: !260)
!268 = !DILocation(line: 97, column: 29, scope: !152, inlinedAt: !260)
!269 = !DILocation(line: 97, column: 27, scope: !152, inlinedAt: !260)
!270 = !DILocation(line: 97, column: 57, scope: !152, inlinedAt: !260)
!271 = !DILocation(line: 97, column: 63, scope: !152, inlinedAt: !260)
!272 = !DILocation(line: 97, column: 12, scope: !152, inlinedAt: !260)
!273 = !DILocation(line: 100, column: 20, scope: !152, inlinedAt: !260)
!274 = !DILocation(line: 100, column: 19, scope: !152, inlinedAt: !260)
!275 = !DILocation(line: 100, column: 17, scope: !152, inlinedAt: !260)
!276 = !{!277, !279}
!277 = distinct !{!277, !278, !"\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z: %origin"}
!278 = distinct !{!278, !"\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z"}
!279 = distinct !{!279, !278, !"\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z: %direction"}
!280 = !DILocation(line: 103, column: 59, scope: !152, inlinedAt: !260)
!281 = !DILocation(line: 103, column: 31, scope: !152, inlinedAt: !260)
!282 = !DILocation(line: 103, column: 20, scope: !152, inlinedAt: !260)
!283 = !DILocation(line: 103, column: 12, scope: !152, inlinedAt: !260)
!284 = !DILocation(line: 105, column: 18, scope: !152, inlinedAt: !260)
!285 = !DILocation(line: 105, column: 15, scope: !152, inlinedAt: !260)
!286 = !DILocation(line: 106, column: 14, scope: !152, inlinedAt: !260)
!287 = !DILocation(line: 106, column: 12, scope: !152, inlinedAt: !260)
!288 = !DILocation(line: 107, column: 27, scope: !152, inlinedAt: !260)
!289 = !DILocation(line: 107, column: 39, scope: !152, inlinedAt: !260)
!290 = !DILocation(line: 107, column: 37, scope: !152, inlinedAt: !260)
!291 = !DILocation(line: 107, column: 17, scope: !152, inlinedAt: !260)
!292 = !DILocation(line: 107, column: 15, scope: !152, inlinedAt: !260)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !135, file: !115, line: 132, type: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 132, size: 256, align: 32, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !294, file: !1, line: 132, baseType: !40, size: 96, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !294, file: !1, line: 132, baseType: !18, size: 32, align: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !294, file: !1, line: 132, baseType: !40, size: 96, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !294, file: !1, line: 132, baseType: !18, size: 32, align: 32, offset: 224)
!300 = !DILocation(line: 132, column: 13, scope: !135)
!301 = !DILocation(line: 133, column: 18, scope: !135)
!302 = !DILocation(line: 133, column: 9, scope: !135)
!303 = !DILocation(line: 133, column: 16, scope: !135)
!304 = !DILocation(line: 134, column: 21, scope: !135)
!305 = !DILocation(line: 134, column: 9, scope: !135)
!306 = !DILocation(line: 134, column: 19, scope: !135)
!307 = !DILocation(line: 137, column: 9, scope: !135)
!308 = !DILocation(line: 137, column: 14, scope: !135)
!309 = !DILocation(line: 138, column: 9, scope: !135)
!310 = !DILocation(line: 138, column: 14, scope: !135)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !135, file: !115, line: 139, type: !142)
!312 = !DILocation(line: 139, column: 16, scope: !135)
!313 = !DILocation(line: 139, column: 26, scope: !135)
!314 = !DILocation(line: 140, column: 5, scope: !135)
!315 = !DILocation(line: 143, column: 52, scope: !135)
!316 = !DILocation(line: 143, column: 18, scope: !135)
!317 = !DILocation(line: 143, column: 5, scope: !135)
!318 = !DILocation(line: 143, column: 42, scope: !135)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !152, file: !115, line: 94, type: !4)
!320 = !DILocation(line: 94, column: 37, scope: !152, inlinedAt: !260)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !152, file: !115, line: 96, type: !30)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !152, file: !115, line: 97, type: !30)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !152, file: !115, line: 103, type: !14)
!324 = !DILocation(line: 144, column: 1, scope: !135)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !138, file: !115, line: 147, type: !145)
!326 = !DILocation(line: 147, column: 67, scope: !138)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !138, file: !115, line: 147, type: !141)
!328 = !DILocation(line: 147, column: 42, scope: !138)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hitPosition", scope: !138, file: !115, line: 149, type: !39)
!330 = !DILocation(line: 149, column: 12, scope: !138)
!331 = !DILocation(line: 71, column: 12, scope: !59, inlinedAt: !332)
!332 = distinct !DILocation(line: 149, column: 26, scope: !138)
!333 = !DILocation(line: 71, column: 31, scope: !59, inlinedAt: !332)
!334 = !DILocation(line: 71, column: 47, scope: !59, inlinedAt: !332)
!335 = !DILocation(line: 71, column: 45, scope: !59, inlinedAt: !332)
!336 = !DILocation(line: 71, column: 29, scope: !59, inlinedAt: !332)
!337 = !DILocation(line: 71, column: 5, scope: !59, inlinedAt: !332)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !138, file: !115, line: 152, type: !125)
!339 = !DILocation(line: 152, column: 10, scope: !138)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indicesPerTriangle", scope: !138, file: !115, line: 153, type: !125)
!341 = !DILocation(line: 153, column: 10, scope: !138)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndexStride", scope: !138, file: !115, line: 154, type: !125)
!343 = !DILocation(line: 154, column: 10, scope: !138)
!344 = !DILocation(line: 154, column: 32, scope: !138)
!345 = !DILocation(line: 154, column: 53, scope: !138)
!346 = !DILocation(line: 154, column: 51, scope: !138)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseIndex", scope: !138, file: !115, line: 155, type: !125)
!348 = !DILocation(line: 155, column: 10, scope: !138)
!349 = !DILocation(line: 155, column: 22, scope: !138)
!350 = !DILocation(line: 155, column: 41, scope: !138)
!351 = !DILocation(line: 155, column: 39, scope: !138)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !138, file: !115, line: 158, type: !353)
